; domain
(define (domain abyssus-base)
    (:requirements
        :strips
        :typing
        :negative-preconditions
        :equality
        :fluents
        :action-costs
        :quantified-preconditions
    )

    (:types
        locatable location - object
        rov sample capsule - locatable
        pressure-sensitive - sample
        pressure-stabilizer docking-station - location
    )

    (:predicates
        ;; Positions and movement
        (at ?x - locatable ?l - location)
        (connected ?from - location ?to - location)

        ;; ROV state
        (handempty ?r - rov)
        (carrying ?r - rov ?x - locatable)

        ;; Sample categories and final state
        (regular-sample ?s - sample)
        (stabilized ?s - sample)
        (stored ?s - sample)

        ;; Special locations
        (bio-vault ?l - location)

        ;; Capsule state
        (empty-capsule ?c - capsule)
        (sample-in-capsule ?s - sample ?c - capsule)
        (capsule-sealed ?c - capsule)
    )

    (:functions
        (battery-level ?r - rov)
        (total-cost)
    )

    ;; ------------------------------------------------------------
    ;; Movement
    ;; ------------------------------------------------------------

    (:action move
        :parameters (?r - rov ?from - location ?to - location)
        :precondition (and
            (not (= ?from ?to))
            (at ?r ?from)
            (connected ?from ?to)
            (>= (battery-level ?r) 2)
        )
        :effect (and
            (not (at ?r ?from))
            (at ?r ?to)
            (decrease (battery-level ?r) 2)
            (increase (total-cost) 10000)
        )
    )

    ;; ------------------------------------------------------------
    ;; Regular sample handling
    ;; ------------------------------------------------------------

    (:action pickup-regular-sample
        :parameters (?r - rov ?s - sample ?l - location)
        :precondition (and
            (at ?r ?l)
            (at ?s ?l)
            (regular-sample ?s)
            (handempty ?r)
            (>= (battery-level ?r) 1)
        )
        :effect (and
            (not (handempty ?r))
            (not (at ?s ?l))
            (carrying ?r ?s)
            (decrease (battery-level ?r) 1)
            (increase (total-cost) 1)
        )
    )

    (:action drop-regular-sample
        :parameters (?r - rov ?s - sample ?l - location)
        :precondition (and
            (at ?r ?l)
            (carrying ?r ?s)
            (regular-sample ?s)
            (>= (battery-level ?r) 1)
        )
        :effect (and
            (not (carrying ?r ?s))
            (at ?s ?l)
            (handempty ?r)
            (decrease (battery-level ?r) 1)
            (increase (total-cost) 50)
        )
    )

    (:action store-regular-sample
        :parameters (?r - rov ?s - sample ?l - location)
        :precondition (and
            (at ?r ?l)
            (bio-vault ?l)
            (carrying ?r ?s)
            (regular-sample ?s)
            (>= (battery-level ?r) 1)
        )
        :effect (and
            (not (carrying ?r ?s))
            (stored ?s)
            (handempty ?r)
            (decrease (battery-level ?r) 1)
            (increase (total-cost) 0)
        )
    )

    ;; ------------------------------------------------------------
    ;; Pressure-sensitive sample handling with capsules
    ;; ------------------------------------------------------------

    (:action take-empty-capsule
        :parameters (?r - rov ?c - capsule ?l - location)
        :precondition (and
            (at ?r ?l)
            (at ?c ?l)
            (empty-capsule ?c)
            (handempty ?r)
            (>= (battery-level ?r) 1)
        )
        :effect (and
            (not (at ?c ?l))
            (not (handempty ?r))
            (carrying ?r ?c)
            (decrease (battery-level ?r) 1)
            (increase (total-cost) 1)
        )
    )

    (:action encapsulate-sample
        :parameters (?r - rov ?s - pressure-sensitive ?c - capsule ?l - location)
        :precondition (and
            (at ?r ?l)
            (at ?s ?l)
            (carrying ?r ?c)
            (empty-capsule ?c)
            (>= (battery-level ?r) 1)
        )
        :effect (and
            (not (empty-capsule ?c))
            (not (at ?s ?l))
            (sample-in-capsule ?s ?c)
            (capsule-sealed ?c)
            (decrease (battery-level ?r) 1)
            (increase (total-cost) 5)
        )
    )

    (:action pickup-sensitive-sample
        :parameters (?r - rov ?s - pressure-sensitive ?c - capsule ?l - location)
        :precondition (and
            (at ?r ?l)
            (at ?c ?l)
            (sample-in-capsule ?s ?c)
            (capsule-sealed ?c)
            (handempty ?r)
            (>= (battery-level ?r) 1)
        )
        :effect (and
            (not (handempty ?r))
            (not (at ?c ?l)) 
            (carrying ?r ?c) ; the robot is carrying the capsule with the sample inside
            (decrease (battery-level ?r) 1)
            (increase (total-cost) 1)
        )
    )

    (:action drop-sensitive-sample
        :parameters (?r - rov ?s - pressure-sensitive ?c - capsule ?l - location)
        :precondition (and
            (at ?r ?l)
            (carrying ?r ?c)
            (sample-in-capsule ?s ?c)
            (capsule-sealed ?c)
            (>= (battery-level ?r) 1)
        )
        :effect (and
            (not (carrying ?r ?c))
            (at ?c ?l)
            (handempty ?r)
            (decrease (battery-level ?r) 1)
            (increase (total-cost) 100)
        )
    )

    (:action stabilize-capsule
        :parameters (?r - rov ?s - pressure-sensitive ?c - capsule ?l - pressure-stabilizer)
        :precondition (and
            (at ?r ?l)
            (at ?c ?l)
            (sample-in-capsule ?s ?c)
            (capsule-sealed ?c)
            (not (stabilized ?s))
        )
        :effect (and
            (stabilized ?s)
            (increase (total-cost) 10)
        )
    )

    (:action store-sensitive-sample
        :parameters (?r - rov ?s - pressure-sensitive ?c - capsule ?l - location)
        :precondition (and
            (at ?r ?l)
            (bio-vault ?l)
            (carrying ?r ?c)
            (sample-in-capsule ?s ?c)
            (capsule-sealed ?c)
            (stabilized ?s)
            (>= (battery-level ?r) 1)
        )
        :effect (and
            (not (capsule-sealed ?c))
            (stored ?s)
            (empty-capsule ?c)
            (not (sample-in-capsule ?s ?c))
            (not (carrying ?r ?c))
            (at ?c ?l)
            (handempty ?r)
            (increase (total-cost) 1)
            (decrease (battery-level ?r) 1)
        )
    )

    ;; ------------------------------------------------------------
    ;; Recharge
    ;; ------------------------------------------------------------

    (:action recharge
        :parameters (?r - rov ?l - docking-station)
        :precondition (and
            (at ?r ?l)
            (< (battery-level ?r) 30)
        )
        :effect (and
            (assign (battery-level ?r) 30)
            (increase (total-cost) 1000)
        )
    )
)

; problem
(define (problem t1)
    (:domain abyssus-base)

    (:objects
        rov1 - rov

        s1 s2 s6 - sample
        s3 s4 s5 - pressure-sensitive

        cap1 cap2 - capsule

        wing_alpha wing_beta transfer_zone decompression_chamber bio_vault - location
        docking_station - docking-station
        pressure_stabilizer - pressure-stabilizer
    )

    (:init
        ;; Connections
        (connected transfer_zone wing_alpha)
        (connected wing_alpha transfer_zone)

        (connected transfer_zone wing_beta)
        (connected wing_beta transfer_zone)

        (connected transfer_zone docking_station)
        (connected docking_station transfer_zone)

        (connected transfer_zone decompression_chamber)
        (connected decompression_chamber transfer_zone)

        (connected decompression_chamber pressure_stabilizer)
        (connected pressure_stabilizer decompression_chamber)

        (connected pressure_stabilizer bio_vault)
        (connected bio_vault pressure_stabilizer)
        
        (connected decompression_chamber bio_vault)
        (connected bio_vault decompression_chamber)


        ;; Special locations
        (bio-vault bio_vault)

        ;; ROV initial state
        (at rov1 docking_station)
        (handempty rov1)

        ;; Regular samples
        (regular-sample s1)
        (regular-sample s2)
        (regular-sample s6)

        ;; Sample positions
        (at s1 wing_alpha)
        (at s2 wing_alpha)
        (at s3 wing_alpha)
        (at s4 wing_alpha)
        (at s5 wing_beta)
        (at s6 wing_beta)

        ;; Capsules
        (at cap1 wing_alpha)
        (at cap2 wing_alpha)

        (empty-capsule cap1)
        (empty-capsule cap2)

        ;; Numeric values
        (= (battery-level rov1) 30)
        (= (total-cost) 0)
    )

    (:goal
        (and
            (forall (?s - sample)
                (stored ?s)
            )
        )
    )

    (:metric minimize (total-cost))
)

; plan
1. (move rov1 docking_station transfer_zone)
   deleted: (at rov1 docking_station)
   added: (at rov1 transfer_zone)
   changed: (battery-level rov1) from 30 to 28
   goals met: 0 of 1
2. (move rov1 transfer_zone wing_alpha)
   deleted: (at rov1 transfer_zone)
   added: (at rov1 wing_alpha)
   changed: (battery-level rov1) from 28 to 26
   goals met: 0 of 1
3. (take-empty-capsule rov1 cap2 wing_alpha)
   deleted: (at cap2 wing_alpha) (handempty rov1)
   added: (carrying rov1 cap2)
   changed: (battery-level rov1) from 26 to 25
   goals met: 0 of 1
4. (encapsulate-sample rov1 s3 cap2 wing_alpha)
   deleted: (empty-capsule cap2) (at s3 wing_alpha)
   added: (sample-in-capsule s3 cap2) (capsule-sealed cap2)
   changed: (battery-level rov1) from 25 to 24
   goals met: 0 of 1
5. (move rov1 wing_alpha transfer_zone)
   deleted: (at rov1 wing_alpha)
   added: (at rov1 transfer_zone)
   changed: (battery-level rov1) from 24 to 22
   goals met: 0 of 1
6. (move rov1 transfer_zone decompression_chamber)
   deleted: (at rov1 transfer_zone)
   added: (at rov1 decompression_chamber)
   changed: (battery-level rov1) from 22 to 20
   goals met: 0 of 1
7. (move rov1 decompression_chamber pressure_stabilizer)
   deleted: (at rov1 decompression_chamber)
   added: (at rov1 pressure_stabilizer)
   changed: (battery-level rov1) from 20 to 18
   goals met: 0 of 1
8. (drop-sensitive-sample rov1 s3 cap2 pressure_stabilizer)
   deleted: (carrying rov1 cap2)
   added: (at cap2 pressure_stabilizer) (handempty rov1)
   changed: (battery-level rov1) from 18 to 17
   goals met: 0 of 1
9. (stabilize-capsule rov1 s3 cap2 pressure_stabilizer)
   added: (stabilized s3)
   goals met: 0 of 1
10. (pickup-sensitive-sample rov1 s3 cap2 pressure_stabilizer)
   deleted: (handempty rov1) (at cap2 pressure_stabilizer)
   added: (carrying rov1 cap2)
   changed: (battery-level rov1) from 17 to 16
   goals met: 0 of 1
11. (move rov1 pressure_stabilizer decompression_chamber)
   deleted: (at rov1 pressure_stabilizer)
   added: (at rov1 decompression_chamber)
   changed: (battery-level rov1) from 16 to 14
   goals met: 0 of 1
12. (move rov1 decompression_chamber transfer_zone)
   deleted: (at rov1 decompression_chamber)
   added: (at rov1 transfer_zone)
   changed: (battery-level rov1) from 14 to 12
   goals met: 0 of 1
13. (drop-sensitive-sample rov1 s3 cap2 transfer_zone)
   deleted: (carrying rov1 cap2)
   added: (at cap2 transfer_zone) (handempty rov1)
   changed: (battery-level rov1) from 12 to 11
   goals met: 0 of 1
14. (move rov1 transfer_zone wing_alpha)
   deleted: (at rov1 transfer_zone)
   added: (at rov1 wing_alpha)
   changed: (battery-level rov1) from 11 to 9
   goals met: 0 of 1
15. (take-empty-capsule rov1 cap1 wing_alpha)
   deleted: (at cap1 wing_alpha) (handempty rov1)
   added: (carrying rov1 cap1)
   changed: (battery-level rov1) from 9 to 8
   goals met: 0 of 1
16. (encapsulate-sample rov1 s4 cap1 wing_alpha)
   deleted: (empty-capsule cap1) (at s4 wing_alpha)
   added: (sample-in-capsule s4 cap1) (capsule-sealed cap1)
   changed: (battery-level rov1) from 8 to 7
   goals met: 0 of 1
17. (move rov1 wing_alpha transfer_zone)
   deleted: (at rov1 wing_alpha)
   added: (at rov1 transfer_zone)
   changed: (battery-level rov1) from 7 to 5
   goals met: 0 of 1
18. (drop-sensitive-sample rov1 s4 cap1 transfer_zone)
   deleted: (carrying rov1 cap1)
   added: (at cap1 transfer_zone) (handempty rov1)
   changed: (battery-level rov1) from 5 to 4
   goals met: 0 of 1
19. (pickup-sensitive-sample rov1 s3 cap2 transfer_zone)
   deleted: (handempty rov1) (at cap2 transfer_zone)
   added: (carrying rov1 cap2)
   changed: (battery-level rov1) from 4 to 3
   goals met: 0 of 1
20. (move rov1 transfer_zone docking_station)
   deleted: (at rov1 transfer_zone)
   added: (at rov1 docking_station)
   changed: (battery-level rov1) from 3 to 1
   goals met: 0 of 1
21. (recharge rov1 docking_station)
   changed: (battery-level rov1) from 1 to 30
   goals met: 0 of 1
22. (move rov1 docking_station transfer_zone)
   deleted: (at rov1 docking_station)
   added: (at rov1 transfer_zone)
   changed: (battery-level rov1) from 30 to 28
   goals met: 0 of 1
23. (drop-sensitive-sample rov1 s3 cap2 transfer_zone)
   deleted: (carrying rov1 cap2)
   added: (at cap2 transfer_zone) (handempty rov1)
   changed: (battery-level rov1) from 28 to 27
   goals met: 0 of 1
24. (pickup-sensitive-sample rov1 s4 cap1 transfer_zone)
   deleted: (handempty rov1) (at cap1 transfer_zone)
   added: (carrying rov1 cap1)
   changed: (battery-level rov1) from 27 to 26
   goals met: 0 of 1
25. (move rov1 transfer_zone decompression_chamber)
   deleted: (at rov1 transfer_zone)
   added: (at rov1 decompression_chamber)
   changed: (battery-level rov1) from 26 to 24
   goals met: 0 of 1
26. (move rov1 decompression_chamber pressure_stabilizer)
   deleted: (at rov1 decompression_chamber)
   added: (at rov1 pressure_stabilizer)
   changed: (battery-level rov1) from 24 to 22
   goals met: 0 of 1
27. (drop-sensitive-sample rov1 s4 cap1 pressure_stabilizer)
   deleted: (carrying rov1 cap1)
   added: (at cap1 pressure_stabilizer) (handempty rov1)
   changed: (battery-level rov1) from 22 to 21
   goals met: 0 of 1
28. (stabilize-capsule rov1 s4 cap1 pressure_stabilizer)
   added: (stabilized s4)
   goals met: 0 of 1
29. (pickup-sensitive-sample rov1 s4 cap1 pressure_stabilizer)
   deleted: (handempty rov1) (at cap1 pressure_stabilizer)
   added: (carrying rov1 cap1)
   changed: (battery-level rov1) from 21 to 20
   goals met: 0 of 1
30. (move rov1 pressure_stabilizer bio_vault)
   deleted: (at rov1 pressure_stabilizer)
   added: (at rov1 bio_vault)
   changed: (battery-level rov1) from 20 to 18
   goals met: 0 of 1
31. (store-sensitive-sample rov1 s4 cap1 bio_vault)
   deleted: (capsule-sealed cap1) (sample-in-capsule s4 cap1) (carrying rov1 cap1)
   added: (stored s4) (empty-capsule cap1) (at cap1 bio_vault) (handempty rov1)
   changed: (battery-level rov1) from 18 to 17
   goals met: 0 of 1
32. (move rov1 bio_vault decompression_chamber)
   deleted: (at rov1 bio_vault)
   added: (at rov1 decompression_chamber)
   changed: (battery-level rov1) from 17 to 15
   goals met: 0 of 1
33. (move rov1 decompression_chamber transfer_zone)
   deleted: (at rov1 decompression_chamber)
   added: (at rov1 transfer_zone)
   changed: (battery-level rov1) from 15 to 13
   goals met: 0 of 1
34. (pickup-sensitive-sample rov1 s3 cap2 transfer_zone)
   deleted: (handempty rov1) (at cap2 transfer_zone)
   added: (carrying rov1 cap2)
   changed: (battery-level rov1) from 13 to 12
   goals met: 0 of 1
35. (move rov1 transfer_zone docking_station)
   deleted: (at rov1 transfer_zone)
   added: (at rov1 docking_station)
   changed: (battery-level rov1) from 12 to 10
   goals met: 0 of 1
36. (recharge rov1 docking_station)
   changed: (battery-level rov1) from 10 to 30
   goals met: 0 of 1
37. (move rov1 docking_station transfer_zone)
   deleted: (at rov1 docking_station)
   added: (at rov1 transfer_zone)
   changed: (battery-level rov1) from 30 to 28
   goals met: 0 of 1
38. (move rov1 transfer_zone wing_beta)
   deleted: (at rov1 transfer_zone)
   added: (at rov1 wing_beta)
   changed: (battery-level rov1) from 28 to 26
   goals met: 0 of 1
39. (drop-sensitive-sample rov1 s3 cap2 wing_beta)
   deleted: (carrying rov1 cap2)
   added: (at cap2 wing_beta) (handempty rov1)
   changed: (battery-level rov1) from 26 to 25
   goals met: 0 of 1
40. (pickup-regular-sample rov1 s6 wing_beta)
   deleted: (handempty rov1) (at s6 wing_beta)
   added: (carrying rov1 s6)
   changed: (battery-level rov1) from 25 to 24
   goals met: 0 of 1
41. (move rov1 wing_beta transfer_zone)
   deleted: (at rov1 wing_beta)
   added: (at rov1 transfer_zone)
   changed: (battery-level rov1) from 24 to 22
   goals met: 0 of 1
42. (move rov1 transfer_zone decompression_chamber)
   deleted: (at rov1 transfer_zone)
   added: (at rov1 decompression_chamber)
   changed: (battery-level rov1) from 22 to 20
   goals met: 0 of 1
43. (move rov1 decompression_chamber bio_vault)
   deleted: (at rov1 decompression_chamber)
   added: (at rov1 bio_vault)
   changed: (battery-level rov1) from 20 to 18
   goals met: 0 of 1
44. (store-regular-sample rov1 s6 bio_vault)
   deleted: (carrying rov1 s6)
   added: (stored s6) (handempty rov1)
   changed: (battery-level rov1) from 18 to 17
   goals met: 0 of 1
45. (move rov1 bio_vault decompression_chamber)
   deleted: (at rov1 bio_vault)
   added: (at rov1 decompression_chamber)
   changed: (battery-level rov1) from 17 to 15
   goals met: 0 of 1
46. (move rov1 decompression_chamber transfer_zone)
   deleted: (at rov1 decompression_chamber)
   added: (at rov1 transfer_zone)
   changed: (battery-level rov1) from 15 to 13
   goals met: 0 of 1
47. (move rov1 transfer_zone wing_beta)
   deleted: (at rov1 transfer_zone)
   added: (at rov1 wing_beta)
   changed: (battery-level rov1) from 13 to 11
   goals met: 0 of 1
48. (pickup-sensitive-sample rov1 s3 cap2 wing_beta)
   deleted: (handempty rov1) (at cap2 wing_beta)
   added: (carrying rov1 cap2)
   changed: (battery-level rov1) from 11 to 10
   goals met: 0 of 1
49. (move rov1 wing_beta transfer_zone)
   deleted: (at rov1 wing_beta)
   added: (at rov1 transfer_zone)
   changed: (battery-level rov1) from 10 to 8
   goals met: 0 of 1
50. (move rov1 transfer_zone docking_station)
   deleted: (at rov1 transfer_zone)
   added: (at rov1 docking_station)
   changed: (battery-level rov1) from 8 to 6
   goals met: 0 of 1
51. (recharge rov1 docking_station)
   changed: (battery-level rov1) from 6 to 30
   goals met: 0 of 1
52. (move rov1 docking_station transfer_zone)
   deleted: (at rov1 docking_station)
   added: (at rov1 transfer_zone)
   changed: (battery-level rov1) from 30 to 28
   goals met: 0 of 1
53. (move rov1 transfer_zone wing_alpha)
   deleted: (at rov1 transfer_zone)
   added: (at rov1 wing_alpha)
   changed: (battery-level rov1) from 28 to 26
   goals met: 0 of 1
54. (drop-sensitive-sample rov1 s3 cap2 wing_alpha)
   deleted: (carrying rov1 cap2)
   added: (at cap2 wing_alpha) (handempty rov1)
   changed: (battery-level rov1) from 26 to 25
   goals met: 0 of 1
55. (pickup-regular-sample rov1 s1 wing_alpha)
   deleted: (handempty rov1) (at s1 wing_alpha)
   added: (carrying rov1 s1)
   changed: (battery-level rov1) from 25 to 24
   goals met: 0 of 1
56. (move rov1 wing_alpha transfer_zone)
   deleted: (at rov1 wing_alpha)
   added: (at rov1 transfer_zone)
   changed: (battery-level rov1) from 24 to 22
   goals met: 0 of 1
57. (move rov1 transfer_zone decompression_chamber)
   deleted: (at rov1 transfer_zone)
   added: (at rov1 decompression_chamber)
   changed: (battery-level rov1) from 22 to 20
   goals met: 0 of 1
58. (move rov1 decompression_chamber bio_vault)
   deleted: (at rov1 decompression_chamber)
   added: (at rov1 bio_vault)
   changed: (battery-level rov1) from 20 to 18
   goals met: 0 of 1
59. (store-regular-sample rov1 s1 bio_vault)
   deleted: (carrying rov1 s1)
   added: (stored s1) (handempty rov1)
   changed: (battery-level rov1) from 18 to 17
   goals met: 0 of 1
60. (move rov1 bio_vault decompression_chamber)
   deleted: (at rov1 bio_vault)
   added: (at rov1 decompression_chamber)
   changed: (battery-level rov1) from 17 to 15
   goals met: 0 of 1
61. (move rov1 decompression_chamber transfer_zone)
   deleted: (at rov1 decompression_chamber)
   added: (at rov1 transfer_zone)
   changed: (battery-level rov1) from 15 to 13
   goals met: 0 of 1
62. (move rov1 transfer_zone wing_alpha)
   deleted: (at rov1 transfer_zone)
   added: (at rov1 wing_alpha)
   changed: (battery-level rov1) from 13 to 11
   goals met: 0 of 1
63. (pickup-sensitive-sample rov1 s3 cap2 wing_alpha)
   deleted: (handempty rov1) (at cap2 wing_alpha)
   added: (carrying rov1 cap2)
   changed: (battery-level rov1) from 11 to 10
   goals met: 0 of 1
64. (move rov1 wing_alpha transfer_zone)
   deleted: (at rov1 wing_alpha)
   added: (at rov1 transfer_zone)
   changed: (battery-level rov1) from 10 to 8
   goals met: 0 of 1
65. (move rov1 transfer_zone docking_station)
   deleted: (at rov1 transfer_zone)
   added: (at rov1 docking_station)
   changed: (battery-level rov1) from 8 to 6
   goals met: 0 of 1
66. (recharge rov1 docking_station)
   changed: (battery-level rov1) from 6 to 30
   goals met: 0 of 1
67. (move rov1 docking_station transfer_zone)
   deleted: (at rov1 docking_station)
   added: (at rov1 transfer_zone)
   changed: (battery-level rov1) from 30 to 28
   goals met: 0 of 1
68. (move rov1 transfer_zone wing_alpha)
   deleted: (at rov1 transfer_zone)
   added: (at rov1 wing_alpha)
   changed: (battery-level rov1) from 28 to 26
   goals met: 0 of 1
69. (drop-sensitive-sample rov1 s3 cap2 wing_alpha)
   deleted: (carrying rov1 cap2)
   added: (at cap2 wing_alpha) (handempty rov1)
   changed: (battery-level rov1) from 26 to 25
   goals met: 0 of 1
70. (pickup-regular-sample rov1 s2 wing_alpha)
   deleted: (handempty rov1) (at s2 wing_alpha)
   added: (carrying rov1 s2)
   changed: (battery-level rov1) from 25 to 24
   goals met: 0 of 1
71. (move rov1 wing_alpha transfer_zone)
   deleted: (at rov1 wing_alpha)
   added: (at rov1 transfer_zone)
   changed: (battery-level rov1) from 24 to 22
   goals met: 0 of 1
72. (move rov1 transfer_zone decompression_chamber)
   deleted: (at rov1 transfer_zone)
   added: (at rov1 decompression_chamber)
   changed: (battery-level rov1) from 22 to 20
   goals met: 0 of 1
73. (move rov1 decompression_chamber bio_vault)
   deleted: (at rov1 decompression_chamber)
   added: (at rov1 bio_vault)
   changed: (battery-level rov1) from 20 to 18
   goals met: 0 of 1
74. (store-regular-sample rov1 s2 bio_vault)
   deleted: (carrying rov1 s2)
   added: (stored s2) (handempty rov1)
   changed: (battery-level rov1) from 18 to 17
   goals met: 0 of 1
75. (move rov1 bio_vault decompression_chamber)
   deleted: (at rov1 bio_vault)
   added: (at rov1 decompression_chamber)
   changed: (battery-level rov1) from 17 to 15
   goals met: 0 of 1
76. (move rov1 decompression_chamber transfer_zone)
   deleted: (at rov1 decompression_chamber)
   added: (at rov1 transfer_zone)
   changed: (battery-level rov1) from 15 to 13
   goals met: 0 of 1
77. (move rov1 transfer_zone wing_alpha)
   deleted: (at rov1 transfer_zone)
   added: (at rov1 wing_alpha)
   changed: (battery-level rov1) from 13 to 11
   goals met: 0 of 1
78. (pickup-sensitive-sample rov1 s3 cap2 wing_alpha)
   deleted: (handempty rov1) (at cap2 wing_alpha)
   added: (carrying rov1 cap2)
   changed: (battery-level rov1) from 11 to 10
   goals met: 0 of 1
79. (move rov1 wing_alpha transfer_zone)
   deleted: (at rov1 wing_alpha)
   added: (at rov1 transfer_zone)
   changed: (battery-level rov1) from 10 to 8
   goals met: 0 of 1
80. (move rov1 transfer_zone docking_station)
   deleted: (at rov1 transfer_zone)
   added: (at rov1 docking_station)
   changed: (battery-level rov1) from 8 to 6
   goals met: 0 of 1
81. (recharge rov1 docking_station)
   changed: (battery-level rov1) from 6 to 30
   goals met: 0 of 1
82. (move rov1 docking_station transfer_zone)
   deleted: (at rov1 docking_station)
   added: (at rov1 transfer_zone)
   changed: (battery-level rov1) from 30 to 28
   goals met: 0 of 1
83. (move rov1 transfer_zone decompression_chamber)
   deleted: (at rov1 transfer_zone)
   added: (at rov1 decompression_chamber)
   changed: (battery-level rov1) from 28 to 26
   goals met: 0 of 1
84. (move rov1 decompression_chamber bio_vault)
   deleted: (at rov1 decompression_chamber)
   added: (at rov1 bio_vault)
   changed: (battery-level rov1) from 26 to 24
   goals met: 0 of 1
85. (store-sensitive-sample rov1 s3 cap2 bio_vault)
   deleted: (capsule-sealed cap2) (sample-in-capsule s3 cap2) (carrying rov1 cap2)
   added: (stored s3) (empty-capsule cap2) (at cap2 bio_vault) (handempty rov1)
   changed: (battery-level rov1) from 24 to 23
   goals met: 0 of 1
86. (take-empty-capsule rov1 cap1 bio_vault)
   deleted: (at cap1 bio_vault) (handempty rov1)
   added: (carrying rov1 cap1)
   changed: (battery-level rov1) from 23 to 22
   goals met: 0 of 1
87. (move rov1 bio_vault decompression_chamber)
   deleted: (at rov1 bio_vault)
   added: (at rov1 decompression_chamber)
   changed: (battery-level rov1) from 22 to 20
   goals met: 0 of 1
88. (move rov1 decompression_chamber transfer_zone)
   deleted: (at rov1 decompression_chamber)
   added: (at rov1 transfer_zone)
   changed: (battery-level rov1) from 20 to 18
   goals met: 0 of 1
89. (move rov1 transfer_zone wing_beta)
   deleted: (at rov1 transfer_zone)
   added: (at rov1 wing_beta)
   changed: (battery-level rov1) from 18 to 16
   goals met: 0 of 1
90. (encapsulate-sample rov1 s5 cap1 wing_beta)
   deleted: (empty-capsule cap1) (at s5 wing_beta)
   added: (sample-in-capsule s5 cap1) (capsule-sealed cap1)
   changed: (battery-level rov1) from 16 to 15
   goals met: 0 of 1
91. (move rov1 wing_beta transfer_zone)
   deleted: (at rov1 wing_beta)
   added: (at rov1 transfer_zone)
   changed: (battery-level rov1) from 15 to 13
   goals met: 0 of 1
92. (move rov1 transfer_zone decompression_chamber)
   deleted: (at rov1 transfer_zone)
   added: (at rov1 decompression_chamber)
   changed: (battery-level rov1) from 13 to 11
   goals met: 0 of 1
93. (move rov1 decompression_chamber pressure_stabilizer)
   deleted: (at rov1 decompression_chamber)
   added: (at rov1 pressure_stabilizer)
   changed: (battery-level rov1) from 11 to 9
   goals met: 0 of 1
94. (drop-sensitive-sample rov1 s5 cap1 pressure_stabilizer)
   deleted: (carrying rov1 cap1)
   added: (at cap1 pressure_stabilizer) (handempty rov1)
   changed: (battery-level rov1) from 9 to 8
   goals met: 0 of 1
95. (stabilize-capsule rov1 s5 cap1 pressure_stabilizer)
   added: (stabilized s5)
   goals met: 0 of 1
96. (pickup-sensitive-sample rov1 s5 cap1 pressure_stabilizer)
   deleted: (handempty rov1) (at cap1 pressure_stabilizer)
   added: (carrying rov1 cap1)
   changed: (battery-level rov1) from 8 to 7
   goals met: 0 of 1
97. (move rov1 pressure_stabilizer bio_vault)
   deleted: (at rov1 pressure_stabilizer)
   added: (at rov1 bio_vault)
   changed: (battery-level rov1) from 7 to 5
   goals met: 0 of 1
98. (store-sensitive-sample rov1 s5 cap1 bio_vault)
   deleted: (capsule-sealed cap1) (sample-in-capsule s5 cap1) (carrying rov1 cap1)
   added: (stored s5) (empty-capsule cap1) (at cap1 bio_vault) (handempty rov1)
   changed: (battery-level rov1) from 5 to 4
   goals met: 1 of 1
